var events = [
    {
        id: 1, title: 'भारतीय बंजारा समाज कर्मचारी सेवा संस्था ने ईन दो छात्रोको दत्तक लिया.', description: '',
        photos: ['img/Event 1/dattak.jpeg']
    },
    {
        id: 2, title: 'बंजारा समाज का सर्वांगीण विकास के लिये डिएनटी आयोग के अध्यक्ष को दिनांक ८ एप्रिल २०१७ को चार्टर ऑफ राईट्स एंव ड्युटी का मेमोरंडम देते वक्त.', description: '',
        photos: ['img/Event 1/photo 1.jpeg', 'img/Event 1/photo 2.jpeg']
    },
    {
        id: 3, title: '11 जुन 2023 को दिल्ली स्थीत भारतीय बंजारा समाज कर्मचारी सेवा संस्था के राष्ट्रीय कार्यकारिणी की बैठक.', description: '',
        photos: ['img/Event 1/nan-4.jpeg']
    },
    {
        id: 4, title: 'भारतीय बंजारा समाज कर्मचारी सेवा संस्था महाराष्ट्र प्रदेश कार्यकारिणीची सभा दि. 29 जुलै 2023 रोजी नांदेड येथे संपन्न झाली', description: '',
        photos: ['img/Event 1/nan-2.jpeg', 'img/Event 1/nan-1.jpeg', 'img/Event 1/nan-3.jpeg', 'img/Event 1/image 1.jpg',
            'img/Event 1/image 3.jpg', 'img/Event 1/image 4.jpg', 'img/Event 1/image 5.jpg', 'img/Event 1/image 8.jpg']
    },
    {
        id: 5, title: 'संस्था की हरियाणा राज्य में आयोजित बैठक', description: '',
        photos: ['img/event_3/photo 1.jpeg', 'img/event_3/photo 2.jpeg', 'img/event_3/photo 3.jpeg',
            'img/event_3/photo 4.jpeg']
    },
    {
        id: 6, title: 'नई दिल्‍ली में आयोजित कार्यक्रम १५ अगस्त २०२३',
        description: `भारतीय बंजारा समाज कर्मचारी सेवा संस्‍था के रजत जयंती वर्ष के उपलक्ष्‍य में नई दिल्‍ली स्थित नजफगढ़ टांडे
    में आज़ादी के अमृत महोत्‍सव के अवसर पर 15 अगस्‍त, 2023 को <span class='text-danger'>स्‍वतंत्रता दिवस</span> और बंजारा समाज के समाज सेवी रहे
    समाज सुधारक <span class='text-info'>श्रद्धेय पद्मश्री रामसिंग भानावत जी</span> की जयंती धूमधाम से मनाई गई। इस अवसर पर संस्‍था की वेबसाइट का
    भी उद्घाटन संस्‍था के राष्‍ट्रीय अध्‍यक्ष डॉ. रामचन्‍दर रमेश आर्य के कर-कमलों द्वारा किया गया। राष्‍ट्रीय
    महासचिव श्री अशोक राठोड़ ने इस कार्यक्रम की विस्‍तार से जानकारी दी। उन्‍होंने कहा कि यह संस्‍था गैर राजनीतिक
    और गैर धार्मिक है। इसलिए हमें आपस में एक-दूसरे का सम्‍मान करते हुए आगे बढ़ना चाहिए। <br />
    2. इस शुभ अवसर पर राष्‍ट्रीय अध्‍यक्ष ने अपने अध्‍यक्षीय संबोधन में कहा कि देश की आज़ादी के लिए स्‍वतंत्रता
    सेनानियों ने अपना सब कुछ न्योछावर कर देश को आज़ादी दिलाई जिनका हमें सदैव स्‍मरण करना चाहिए और उनके द्वारा
    बताए गए मार्ग का अनुसरण करते हुए सभी लोगों के साथ सौहार्दपूर्ण वातावरण में रहकर हमें उन्‍नति करनी चाहिए।
    उन्‍होंने यह भी अवगत कराया कि वर्तमान समय में उपलब्‍ध साधनों का प्रयोग कर प्रगति के मार्ग पर आगे बढ़ना
    चाहिए। वेबसाइट के माध्‍यम से आज हम विश्‍व के साथ जुड़ सकते हैं। वेबसाइट की उपयोगिता से हम लोग लाभान्‍वित हो
    सकते हैं। संस्‍था की इस वेबसाइट के माध्‍यम से संपूर्ण बंजारा समाज को जोड़ा जा सकता है। इसलिए हमें इसका अधिक
    से अधिक प्रयोग करना चाहिए जिससे हमें बहुत लाभ होगा और हमारे बच्‍चों को समाज और देश-दुनिया की जानकारी
    प्राप्‍त होती रहेगी। उन्‍होंने यह भी कहा कि हमें सरकारी योजनाओं का लाभ उठाते हुए अपने बच्‍चों को शिक्षित
    करना चाहिए ताकि वे रोजगार प्राप्‍त कर सकें।<br />
    3. इस अवसर पर संस्‍था के संस्‍थापक श्री दिगंबर राठोड़, महाराष्‍ट्र राज्‍य के अध्‍यक्ष डॉ. वेंकटेश राठोड़,
    कोषाध्‍यक्ष, श्री एकनाथ राठोड़, कार्यकारी अध्‍यक्ष श्री जगन राठोड़, श्रीमती कविता राठोड़ और श्री रामपाल
    राठोड़ उपस्थित थे। उन्‍होंने इस अवसर पर समाज की उन्‍नति के लिए अपने विचारों से अवगत कराया। इस कार्यक्रम में
    देश के विभिन्‍न राज्‍यों के प्रभारी और संस्‍था के सदस्‍य ऑनलाइन माध्यम से जुड़े।<br />
    4. नजफगढ़ टांडे की ओर से श्री विजय कुमार ने सभी का स्‍वागत किया और श्री धनपत धरमसोत ने धन्‍यवाद प्रस्‍ताव
    रखा तथा सभी उपस्थित जनों को धन्‍यवाद दिया।`,
        photos: ['img/event_2/15august_1.jpg', 'img/event_2/15august_2.jpg', 'img/event_2/15august_3.jpg', 'img/event_2/15august_4.jpg']
    },
    {
        id: 7, title: 'महानायक वसंतरावजी नाईक साहेब यांना ५ डिसेंबर २०२३ ला पुष्पहार अर्पण', description: 'विधान भवन नागपूर येथे महानायक वसंतरावजी नाईक साहेब यांना आज दिनांक ५ डिसेंबर २०२३ ला पुष्पहार अर्पण करून अभिवादन केले. मी (प्रा मोहन चव्हाण) सोबत प्रा संदेश चव्हाण, रामसिंग पवार, श्रीराम चव्हाण, तुकाराम चव्हाण, मोरेश्वर राठोड, प्रेम राठोड व ईतर...',
        photos: ['img/5_dec/vasant-1.jpeg', 'img/5_dec/vasant-2.jpeg']
    },
    {
        id: 8, title: 'दिनांक ०६.१२.२०२३ रोजी भारतीय बंजारा समाज कर्मचारी सेवा संस्था, शाखा - चंद्रपूर', description: 'आज दिनांक ०६.१२.२०२३ रोजी भारतीय बंजारा समाज कर्मचारी सेवा संस्था, शाखा, चंद्रपूरच्या माध्यमातून #राज्य स्तरीय अधिवेशन व रजत महोत्सव सोहळा # या बाबत मार्गदर्शन पर बैठकीचे मा. दिगंबर राठोड साहेब, संस्थापक अध्यक्ष व मा. अशोक राठोड साहेब, राष्ट्रीय महासचिव यांचे प्रमुख उपस्थितीत तसेच जिल्हा कार्यकारिणी व महिला आघाडी यांचे वतीने शासकीय विश्रामगृहात आयोजित करण्यात आली. त्या बैठकीचे क्षणचित्रे.',
        photos: ['img/dec_6/chandrapur-1.jpeg', 'img/dec_6/chandrapur-2.jpeg', 'img/dec_6/chandrapur-3.jpeg', 'img/dec_6/chandrapur-4.jpeg',
            'img/dec_6/chandrapur-5.jpeg', 'img/dec_6/chandrapur-6.jpeg']
    },
    {
        id: 9, title: 'गडचिरोली येथे 0७ डिसेंबर २०२३',
        description: 'भारतीय बंजारा समाज कर्मचारी सेवा,संस्था. महाराष्ट्र प्रदेश च्या "राज्य अधिवेशन व रजत महोत्सव" करिता "संपर्क यात्रा" चा तिसरा दिवस गडचिरोली जिल्ह्यात प्रवेश दि.05 डिसेंबर ला प्रारंभ झालेली संपर्क यात्रा चंद्रपूर मधून गडचिरोली येथे 07डिसेंबर ला पोहचली मा.श्री दिगांबरभाऊ राठोड व राष्ट्रीय महासचिव श्री.अशोकभाऊ राठोड नेतृत्व करित असलेल्या यात्रेत प्रदेश अध्यक्ष मा.डॉ. व्यंकटेश राठोड यांच्या सुचनेनुसार उपाध्यक्ष. प्रा.विश्वनाथ राठोड संघटन सचिव इंजि. संजय राठोड सहभागी झाले. गडचिरोलीची सभा मा.श्री.गोवर्धनभाऊ राठोड यांच्या अध्यक्षतेखाली पार पडली दि.08 ला नागपूर येथील आक्रोश मोर्चात सहभागी होऊन दि 09 ला भंडारा जिल्ह्यात प्रवेश करेल-----------------संपर्क यात्रेच्या पुढील प्रवासाला प्रदेश अध्यक्ष डॉ. व्यंकटेश राठोड यांच्या कडून शुभेच्छा',
        photos: ['img/dec_7/gadchiroli-1.jpeg']
    },
    {
        id:10, title:'सोलापूर येथे दिनांक ११ जानेवारी २०२४', description: 'भारतीय बंजारा समाज कर्मचारी सेवा संस्थेच्या वतीने सोलापूर येथे दिनांक ११ जानेवारी २०२४ रोजी संस्थेच्या अधिवेशना संबंधाने आणि संस्थेचा रजत महोत्सव कार्यक्रम संबंधाने मा. श्री.रेवणसिद्ध चव्हाण यांचे कार्यालयात ठिक सायंकाळी ७.०० वाजता सभा आयोजीत करण्यात आली. सविस्तर सकारात्मक चर्चा करण्यात आली. सोलापूर जिल्ह्यातुन अंदाजे १०० लोकं येणार असल्याचे आश्वासन दिले. त्यावेळी माननीय रेवणसिद्ध चव्हाण डीपीडीओ,  मनोहर पवार सहा. निरिक्षक , नरसिंग राठोड पीएसआय, गुलाबसिंग वडते मुख्याध्यापक, गणेश पवार जिल्हा क्रीडा अधिकारी, देसु जाधव, हुन्नु राठोड तंत्रज्ञ,  गणेश राठोड शिक्षक,  दामु राठोड महसुल सहायक,  उमाकांत राठोड ए.एस.आय,  सुनिल पवार, आणि अनेक महिला प्रतिनिधी व तरुण कार्यकर्ते  उपस्थित होते. संस्थेचे संस्थापक मा. दिगंबर राठोड आणि संस्थेचे राष्ट्रीय महासचिव मा. अशोक राठोड यांनी मार्गदर्शन केले व आर.डी. चव्हाण साहेब यांनी सर्वांचे मार्गदर्शन पर आभार मानले.',
        photos: ['img/jan_11/solapur-1.jpeg', 'img/jan_11/solapur-2.jpeg','img/jan_11/solapur-9.jpeg','img/jan_11/solapur-4.jpeg',
        'img/jan_11/solapur-10.jpeg','img/jan_11/solapur-6.jpeg','img/jan_11/solapur-7.jpeg','img/jan_11/solapur-8.jpeg']
    },
    {
        id:11, title:'दिनांक १२.१.२०२४ रोजी उस्मानाबाद आणि लातूर जिल्ह्या', 
        description: 'भारतीय बंजारा समाज कर्मचारी सेवा संस्थेच्या वतीने आयोजित करण्यात आलेल्या राज्य अधिवेशन आणि संस्थेचा रजत महोत्सव कार्यक्रम संबंधाने दिनांक १२.१.२०२४ रोजी उस्मानाबाद आणि लातूर जिल्ह्यातील मा. मंत्री आडे साहेब, मा. दयानंद राठोड साहेब आणि मां. एन. डी. राठोड साहेब यांची धावती भेट घेतली आणि त्यांचें जवळ पत्रके, पावती पुस्तके आणि संमती पत्रके स्वाधीन करण्यात आली.',
        photos:['img/jan_12/1.jpeg']
    },
    {
        id:12, title:'परभणी जिल्ह्यातील उपस्थित सर्व मान्यवरांना सविस्तर मार्गदर्शन',
        description:'भारतीय बंजारा समाज कर्मचारी सेवा संस्थेच्या वतीने नांदेड येथे दिनांक २ व ३ फरवरी २०२४ रोजी होणाऱ्या संस्थेच्या अधिवेशना संबंधाने आणि संस्थेचा रजत महोत्सव कार्यक्रम संबंधाने परभणी जिल्ह्यातील उपस्थित सर्व मान्यवरांना सविस्तर मार्गदर्शन मा. श्री. दिगंबर राठोड संस्थापक यांनी केले आणि मा. श्री. अशोक राठोड राष्ट्रीय महासचिव यांनी आभार मानलें. बैठकीचे वेळी मा. श्री. गोपीनाथ राठोड, शिवराय जाधव, प्रल्हाद चव्हाण, मारोती राठोड, देविदास राठोड, उल्हास राठोड, अरविंद राठोड, मुकींद जाधव आदी मान्यवर उपस्थित होते.',
        photos:['img/jan_14/1.jpeg']
    }
];

var galleryTitle = '';
if (events.length > 0) {

    for (var i = events.length - 1; i > 0; i--) {
        var e = events[i];
        galleryTitle += `<div class="section-title text-left">
        <h4 class="text-danger">${e.title}</h4>
        <p> ${e.description}</p>
        </div>`;
        if (e.photos.length > 0) {
            galleryTitle += `<div class="row portfolio-container" data-aos="fade-up" data-aos-easing="ease-in-out" 
            data-aos-duration="500">`;
            for (var j = 0; j < e.photos.length; j++) {
                var photo = e.photos[j];
                galleryTitle += `<div class="col-lg-4 col-md-6 portfolio-wrap">
<div class="portfolio-item">
  <img src="${photo}" class="img-fluid clickable-image">
</div>
</div>`;
            }
            galleryTitle += '</div>';
        }
    }

    $('#divGalleryPhotos').html(galleryTitle);

} else {
    galleryTitle = `<div class="section-title text-left">
    <h4>No photos available</h4>
    </div>`;
}